package main

import "fmt"

func get(n int) string { //функция для числа до 1е6 выдает ее прописной вид
	var ans string
	ed := []string{"", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"}
	des := []string{"", "десять", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"}
	des1 := []string{"десять", "одинадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"}
	sot := []string{"", "сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот"}
	ed_tis := []string{"", "одна", "две", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"}
	tis := []string{"тысяч", "тысяча", "тысячи", "тысячи", "тысячи", "тысяч", "тысяч", "тысяч", "тысяч", "тысяч"}
	if n%1e9 < 10 {
		if n == 0 {
			return "ноль"
		}
		return ed[n]
	}
	t := n % 1000000 / 1000
	d_t := t % 10

	s := t % 1000 / 100
	ans += sot[s] + " "
	d := t % 100
	//fmt.Println(d)
	if d/10 == 1 {
		ans += des1[d%10] + " тысяч "
	} else {
		ans += des[d/10] + " " + ed_tis[d%10] + " "
	}
	if t != 0 && d/10 != 1 {
		ans += tis[d_t] + " "
	}

	s = n % 1000 / 100
	ans += sot[s] + " "
	d = n % 100
	if d/10 == 1 {
		ans += des1[d%10]
	} else {
		ans += des[d/10] + " " + ed[d%10]
	}
	return ans
}

func main() {
	fmt.Println("Введите целое число: ")
	var n int
	flag := false
	fmt.Scan(&n)
	if n >= 12307 {
		fmt.Println("Внимание! Число больше 12306")
	}
	for n < 12307 {
		if n < 0 {
			n *= -1
		} else if n%7 == 0 {
			n *= 39
		} else if n%9 == 0 {
			n *= 13
			n += 1
		} else {
			n += 2
			n *= 3
		}

		if n%13 == 0 && n%9 == 0 {
			flag = true
			break
		} else {
			n++
		}
	}
	if flag {
		fmt.Println("service error")
		return
	}
	fmt.Printf("Результат выполнения программы: %d", n)
}
